Revit 2026 API

# SpaceSpaceConstruction Property

---

Get the Space Construction of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPSpaceConstruction SpaceConstruction { get; }
```
```vb
Public ReadOnly Property SpaceConstruction As MEPSpaceConstruction
	Get
```
```cpp
public:
property MEPSpaceConstruction^ SpaceConstruction {
	MEPSpaceConstruction^ get ();
}
```
```fsharp
member SpaceConstruction : MEPSpaceConstruction with get
```

#### Property Value

MEPSpaceConstruction

This property is used to get the Space Construction of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace